tap "elgar328/nfd2nfc"
tap "peterldowns/tap"
# Run your GitHub Actions locally
brew "act"
# Official Amazon AWS command-line interface
brew "awscli"
# Emacs dependency management
brew "cask"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Convert filesystem entry names from NFD to NFC for cross-platform compatibility
brew "elgar328/nfd2nfc/nfd2nfc"
# Localias is a tool for developers to securely manage local aliases for development servers.
brew "peterldowns/tap/localias"

# 환경별 Brewfile 불러오기
eval(File.read(File.expand_path("Brewfiles/Brewfile.cask")))
# eval(File.read(File.expand_path("Brewfiles/Brewfile.mas")))
# eval(File.read(File.expand_path("Brewfiles/Brewfile.personal")))
