tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/services"

# Emacs dependency management
brew "cask"
# GitHub command-line tool
brew "gh"
# Mac App Store command-line interface
brew "mas"
# # Open source relational database management system
# brew "mysql"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"

# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Tools for building Android applications
cask "android-studio"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Font
cask "font-d2coding"
cask "font-ibm-plex-mono"
cask "font-nanum-gothic-coding"
# # Web browser
# cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Clipboard manager
cask "maccy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Web browser
cask "naver-whale"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"

mas "Flow", id: 1423210932
mas "Hidden Bar", id: 1452453066
mas "MenubarX", id: 1575588022
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Pixea", id: 1507782672
mas "Xcode", id: 497799835
mas "알라딘 ebook", id: 1023251042
mas "카카오톡", id: 869223134